src/cf/Catalogs/УведомленияАУСН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УведомленияАУСН</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОповещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОповещенийАУСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстВФорматеMarkdown</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстВФорматеPush</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыУведомленийАУСН</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>время создания оповещения в ПП АУСН</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Comment>время последнего обновления сообщения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученаОшибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/УведомленияАУСН/Forms/УведомлениеОтФНС/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ВызватьИсключение НСтр("ru = 'В форме может открываться только ранее записанное уведомление'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ТолькоПросмотр = Истина;
	
	Заголовок = ТекущийОбъект.Наименование;
	
	ТекстВФорматеMarkdown.УстановитьФорматированнуюСтроку(
		СтроковыеФункции.ФорматированнаяСтрока(ТекущийОбъект.ТекстВФорматеMarkdown));
	
	СписокФайлов = Новый Массив;
	РаботаСФайлами.ЗаполнитьПрисоединенныеФайлыКОбъекту(Объект.Ссылка, СписокФайлов);
	Если СписокФайлов.Количество() = 0 Тогда
		Элементы.ПриложенныеФайлы.Видимость = Ложь;
	Иначе
		ЗагрузитьОписанияФайлов(СписокФайлов);
	КонецЕсли;
	
	Элементы.ДатаОбновления.Видимость = (ТекущийОбъект.ДатаСоздания <> ТекущийОбъект.ДатаОбновления);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ТекДанные = Элементы.ПриложенныеФайлы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСФайламиКлиент.ОткрытьФайл(
		РаботаСФайламиКлиент.ДанныеФайла(ТекДанные.Значение, УникальныйИдентификатор));
	
КонецПроцедуры
	
&НаКлиенте
Процедура СохранитьФайл(Команда)
	
	ТекДанные = Элементы.ПриложенныеФайлы.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСФайламиКлиент.СохранитьФайлКак(
		РаботаСФайламиКлиент.ДанныеФайла(ТекДанные.Значение, УникальныйИдентификатор));
	
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиТаблицыФормыПриложенныеФайлы

&НаКлиенте
Процедура ПриложенныеФайлыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	РаботаСФайламиКлиент.ОткрытьФайл(
		РаботаСФайламиКлиент.ДанныеФайла(Элемент.ТекущиеДанные.Значение, УникальныйИдентификатор));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьОписанияФайлов(СписокФайлов)
	
	ПриложенныеФайлы.ЗагрузитьЗначения(СписокФайлов);
	
	ПараметрыФайла = РаботаСФайламиКлиентСервер.ПараметрыДанныхФайла();
	ПараметрыФайла.ИдентификаторФормы             = УникальныйИдентификатор;
	ПараметрыФайла.ПолучатьСсылкуНаДвоичныеДанные = Ложь;
	ПараметрыФайла.ВызыватьИсключение             = Ложь;
	
	Для Каждого ПриложенныйФайл Из ПриложенныеФайлы Цикл
		
		ОписаниеФайла = РаботаСФайлами.ДанныеФайла(ПриложенныйФайл.Значение, ПараметрыФайла);
		Если ОписаниеФайла = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ТипСодержимого = УведомленияОтФНСАУСН.ТипСодержимогоПоРасширению(ОписаниеФайла.Расширение);
		ПодходящаяКартинка = УведомленияОтФНСАУСН.КартинкаПоТипуСодержимого(ТипСодержимого);
		Если ПодходящаяКартинка = Неопределено Тогда // неизвестный  тип
			
			ПриложенныйФайл.Представление = ОписаниеФайла.ИмяФайла;
			ПриложенныйФайл.Картинка = БиблиотекаКартинок.ФорматПустой;
			
		Иначе
			
			ПриложенныйФайл.Представление = ОписаниеФайла.Наименование;
			ПриложенныйФайл.Картинка = ПодходящаяКартинка;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
